const windDirection = {
    'en' : {
            'NNE' : 'NNE',      //deg > 11.25  && deg <= 33.75
            'NE' : 'NE',        //deg > 33.75  && deg <= 56.25
            'ENE' : 'ENE',      //deg > 56.25  && deg <= 78.75
            'E' : 'E',          //deg > 78.75  && deg <= 101.25
            'ESE' : 'ESE',      //deg > 101.25 && deg <= 123.75
            'SE' : 'SE',        //deg > 123.75 && deg <= 146.25
            'SSE' : 'SSE',      //deg > 146.25 && deg <= 168.75
            'S' : 'S',          //deg > 168.75 && deg <= 191.25
            'SSW' : 'SSW',      //deg > 191.25 && deg <= 213.75
            'SW' : 'SW',        //deg > 213.75 && deg <= 236.25
            'WSW' : 'WSW',      //deg > 236.25 && deg <= 258.75
            'W' : 'W',          //deg > 258.75 && deg <= 281.25
            'WNW' : 'WNW',      //deg > 281.25 && deg <= 303.75
            'NW' : 'NW',        //deg > 303.75 && deg <= 326.25
            'NNW' : 'NNW',      //deg > 326.25 && deg <= 348.75
            'N' : 'N',          //deg > 348.75 && deg <= 11.25
    },

    'ru' : {
            'NNE' : 'ССВ',
            'NE' : 'СВ',
            'ENE' : 'ВСВ',
            'E' : 'В',
            'ESE' : 'ВЮВ',
            'SE' : 'ЮВ',
            'SSE' : 'ЮЮВ',
            'S' : 'Ю',
            'SSW' : 'ЮЮЗ',
            'SW' : 'ЮЗ',
            'WSW' : 'ЗЮЗ',
            'W' : 'З',
            'WNW' : 'ЗСЗ',
            'NW' : 'СЗ',
            'NNW' : 'ССЗ',
            'N' : 'С',
            }
};
